# BRepBuilder Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder Constructor
BRepBuilder Class See Also
---
Construct a BRepBuilder to use in constructing geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public BRepBuilder(
	BRepType geomType
)
```

Visual Basic
---
```text
Public Sub New ( _
	geomType As BRepType _
)
```

Visual C++
---
```text
public:
BRepBuilder(
	BRepType geomType
)
```

# ### Parameters
geomType
    Type: Autodesk.Revit.DB..::..BRepType Specifies the expected type of the output geometry.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace